; domain
(define (domain maintenance-scheduling-extended)
  (:requirements :strips :typing)
  
  (:types
    inhabitant room time
  )
  
  (:predicates
    (can-arrive ?i - inhabitant ?t - time)
    (assigned-room ?i - inhabitant ?r - room)
    (scheduled ?i - inhabitant)
    (worker-available ?t - time)
    (unlocked ?r - room ?t - time)
    (at-room ?r - room ?t - time)
  )
  
  (:action unlock
    :parameters (?r - room ?t - time)
    :precondition (and
      (worker-available ?t)
    )
    :effect (and
      (unlocked ?r ?t)
    )
  )
  
  (:action join
    :parameters (?r - room ?t - time)
    :precondition (and
      (unlocked ?r ?t)
      (worker-available ?t)
    )
    :effect (and
      (at-room ?r ?t)
    )
  )
  
  (:action showRoom
    :parameters (?i - inhabitant ?r - room ?t - time)
    :precondition (and
      (can-arrive ?i ?t)
      (assigned-room ?i ?r)
      (at-room ?r ?t)
      (worker-available ?t)
    )
    :effect (and
      (scheduled ?i)
      (not (worker-available ?t))
    )
  )
)

; problem
(define (problem scheduling-problem-extended)
  (:domain maintenance-scheduling-extended)
  
  (:objects
    inhabitant1 inhabitant2 inhabitant3 - inhabitant
    room1 room2 room3 - room
    am9 am915 am10 am1015 am11 - time
  )
  
  (:init
    ; Room assignments
    (assigned-room inhabitant1 room1)
    (assigned-room inhabitant2 room2)
    (assigned-room inhabitant3 room3)
    
    ; Available arrival times for each inhabitant
    (can-arrive inhabitant1 am9)
    (can-arrive inhabitant1 am915)
    (can-arrive inhabitant2 am9)
    (can-arrive inhabitant3 am10)
    (can-arrive inhabitant3 am1015)
    
    ; Worker is initially available at all times
    (worker-available am9)
    (worker-available am915)
    (worker-available am10)
    (worker-available am1015)
    (worker-available am11)
  )
  
  (:goal (and
    (scheduled inhabitant1)
    (scheduled inhabitant2)
    (scheduled inhabitant3)
  ))
)

; plan
1. (unlock room2 am9)
   added: (unlocked room2 am9)
   goals met: 0 of 3
2. (unlock room3 am10)
   added: (unlocked room3 am10)
   goals met: 0 of 3
3. (unlock room1 am915)
   added: (unlocked room1 am915)
   goals met: 0 of 3
4. (join room2 am9)
   added: (at-room room2 am9)
   goals met: 0 of 3
5. (join room3 am10)
   added: (at-room room3 am10)
   goals met: 0 of 3
6. (join room1 am915)
   added: (at-room room1 am915)
   goals met: 0 of 3
7. (showroom inhabitant2 room2 am9)
   deleted: (worker-available am9)
   added: (scheduled inhabitant2)
   goals met: 1 of 3
8. (showroom inhabitant1 room1 am915)
   deleted: (worker-available am915)
   added: (scheduled inhabitant1)
   goals met: 2 of 3
9. (showroom inhabitant3 room3 am10)
   deleted: (worker-available am10)
   added: (scheduled inhabitant3)
   goals met: 3 of 3
